susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32WB5Mx.h
#define LPUART1_TX_PA2_ PA2,GPIO_AF8
#define LPUART1_TX_PB11_ PB11,GPIO_AF8
#define LPUART1_TX_PB5_ PB5,GPIO_AF8
#define LPUART1_TX_PC1_ PC1,GPIO_AF8
#define _LPUART1_TX_PA2_ 1
#define _LPUART1_TX_PB11_ 1
#define _LPUART1_TX_PB5_ 1
#define _LPUART1_TX_PC1_ 1

#define QUADSPI_BK1_IO0_PB9_ PB9,GPIO_AF10
#define QUADSPI_BK1_IO0_PD4_ PD4,GPIO_AF10
#define _QUADSPI_BK1_IO0_PB9_ 1
#define _QUADSPI_BK1_IO0_PD4_ 1

#define QUADSPI_BK1_IO1_PB8_ PB8,GPIO_AF10
#define QUADSPI_BK1_IO1_PD5_ PD5,GPIO_AF10
#define _QUADSPI_BK1_IO1_PB8_ 1
#define _QUADSPI_BK1_IO1_PD5_ 1

#define QUADSPI_BK1_IO2_PA7_ PA7,GPIO_AF10
#define QUADSPI_BK1_IO2_PD6_ PD6,GPIO_AF10
#define _QUADSPI_BK1_IO2_PA7_ 1
#define _QUADSPI_BK1_IO2_PD6_ 1

#define QUADSPI_BK1_IO3_PA6_ PA6,GPIO_AF10
#define QUADSPI_BK1_IO3_PD7_ PD7,GPIO_AF10
#define _QUADSPI_BK1_IO3_PA6_ 1
#define _QUADSPI_BK1_IO3_PD7_ 1

#define QUADSPI_BK1_NCS_PA2_ PA2,GPIO_AF10
#define QUADSPI_BK1_NCS_PB11_ PB11,GPIO_AF10
#define QUADSPI_BK1_NCS_PD3_ PD3,GPIO_AF10
#define _QUADSPI_BK1_NCS_PA2_ 1
#define _QUADSPI_BK1_NCS_PB11_ 1
#define _QUADSPI_BK1_NCS_PD3_ 1

#define QUADSPI_CLK_PA3_ PA3,GPIO_AF10
#define QUADSPI_CLK_PB10_ PB10,GPIO_AF10
#define _QUADSPI_CLK_PA3_ 1
#define _QUADSPI_CLK_PB10_ 1

#define RCC_LSCO_PA2_ PA2,GPIO_AF0
#define RCC_LSCO_PC12_ PC12,GPIO_AF6
#define RCC_LSCO_PH3_ PH3,GPIO_AF0
#define _RCC_LSCO_PA2_ 1
#define _RCC_LSCO_PC12_ 1
#define _RCC_LSCO_PH3_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define RCC_MCO_PB6_ PB6,GPIO_AF0
#define _RCC_MCO_PA8_ 1
#define _RCC_MCO_PB6_ 1

#define RF_DTB0_PC14_ PC14,GPIO_AF6
#define _RF_DTB0_PC14_ 1

#define RF_DTB1_PC15_ PC15,GPIO_AF6
#define _RF_DTB1_PC15_ 1

#define RF_TX_MOD_EXT_PA_PB0_ PB0,GPIO_AF6
#define _RF_TX_MOD_EXT_PA_PB0_ 1

#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PB15_ 1

#define SAI1_CK1_PA3_ PA3,GPIO_AF3
#define SAI1_CK1_PB8_ PB8,GPIO_AF3
#define SAI1_CK1_PE2_ PE2,GPIO_AF3
#define _SAI1_CK1_PA3_ 1
#define _SAI1_CK1_PB8_ 1
#define _SAI1_CK1_PE2_ 1

#define SAI1_CK2_PA8_ PA8,GPIO_AF3
#define _SAI1_CK2_PA8_ 1

#define SAI1_D1_PA10_ PA10,GPIO_AF3
#define SAI1_D1_PC3_ PC3,GPIO_AF3
#define SAI1_D1_PD6_ PD6,GPIO_AF3
#define _SAI1_D1_PA10_ 1
#define _SAI1_D1_PC3_ 1
#define _SAI1_D1_PD6_ 1

#define SAI1_D2_PA9_ PA9,GPIO_AF3
#define SAI1_D2_PB9_ PB9,GPIO_AF3
#define _SAI1_D2_PA9_ 1
#define _SAI1_D2_PB9_ 1

#define SAI1_D3_PC5_ PC5,GPIO_AF3
#define _SAI1_D3_PC5_ 1

#define SAI1_EXTCLK_PA0_ PA0,GPIO_AF13
#define SAI1_EXTCLK_PB2_ PB2,GPIO_AF13
#define _SAI1_EXTCLK_PA0_ 1
#define _SAI1_EXTCLK_PB2_ 1

#define SAI1_FS_A_PA9_ PA9,GPIO_AF13
#define SAI1_FS_A_PB12_ PB12,GPIO_AF13
#define SAI1_FS_A_PB9_ PB9,GPIO_AF13
#define _SAI1_FS_A_PA9_ 1
#define _SAI1_FS_A_PB12_ 1
#define _SAI1_FS_A_PB9_ 1

#define SAI1_FS_B_PA14_ PA14,GPIO_AF13
#define SAI1_FS_B_PA4_ PA4,GPIO_AF13
#define SAI1_FS_B_PB6_ PB6,GPIO_AF13
#define _SAI1_FS_B_PA14_ 1
#define _SAI1_FS_B_PA4_ 1
#define _SAI1_FS_B_PB6_ 1

#define SAI1_MCLK_A_PA3_ PA3,GPIO_AF13
#define SAI1_MCLK_A_PB14_ PB14,GPIO_AF13
#define SAI1_MCLK_A_PB8_ PB8,GPIO_AF13
#define SAI1_MCLK_A_PE2_ PE2,GPIO_AF13
#define _SAI1_MCLK_A_PA3_ 1
#define _SAI1_MCLK_A_PB14_ 1
#define _SAI1_MCLK_A_PB8_ 1
#define _SAI1_MCLK_A_PE2_ 1

#define SAI1_MCLK_B_PB4_ PB4,GPIO_AF13
#define SAI1_MCLK_B_PD5_ PD5,GPIO_AF13
#define _SAI1_MCLK_B_PB4_ 1
#define _SAI1_MCLK_B_PD5_ 1

#define SAI1_SCK_A_PA8_ PA8,GPIO_AF13
#define SAI1_SCK_A_PB10_ PB10,GPIO_AF13
#define SAI1_SCK_A_PB13_ PB13,GPIO_AF13
#define _SAI1_SCK_A_PA8_ 1
#define _SAI1_SCK_A_PB10_ 1
#define _SAI1_SCK_A_PB13_ 1

#define SAI1_SCK_B_PB3_ PB3,GPIO_AF13
#define SAI1_SCK_B_PC9_ PC9,GPIO_AF13
#define _SAI1_SCK_B_PB3_ 1
#define _SAI1_SCK_B_PC9_ 1

#define SAI1_SD_A_PA10_ PA10,GPIO_AF13
#define SAI1_SD_A_PB15_ PB15,GPIO_AF13
#define SAI1_SD_A_PC3_ PC3,GPIO_AF13
#define SAI1_SD_A_PD6_ PD6,GPIO_AF13
#define _SAI1_SD_A_PA10_ 1
#define _SAI1_SD_A_PB15_ 1
#define _SAI1_SD_A_PC3_ 1
#define _SAI1_SD_A_PD6_ 1

#define SAI1_SD_B_PA13_ PA13,GPIO_AF13
#define SAI1_SD_B_PA5_ PA5,GPIO_AF13
#define SAI1_SD_B_PB5_ PB5,GPIO_AF13
#define _SAI1_SD_B_PA13_ 1
#define _SAI1_SD_B_PA5_ 1
#define _SAI1_SD_B_PB5_ 1

#define SPI1_MISO_PA11_ PA11,GPIO_AF5
#define SPI1_MISO_PA6_ PA6,GPIO_AF5
#define SPI1_MISO_PB4_ PB4,GPIO_AF5
#define _SPI1_MISO_PA11_ 1
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4_ 1

#define SPI1_MOSI_PA12_ PA12,GPIO_AF5
#define SPI1_MOSI_PA7_ PA7,GPIO_AF5
#define SPI1_MOSI_PB5_ PB5,GPIO_AF5
#define _SPI1_MOSI_PA12_ 1
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1

#define SPI1_NSS_PA15_ PA15,GPIO_AF5
#define SPI1_NSS_PA4_ PA4,GPIO_AF5
#define SPI1_NSS_PB2_ PB2,GPIO_AF5
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PB2_ 1

#define SPI1_SCK_PA1_ PA1,GPIO_AF5
#define SPI1_SCK_PA5_ PA5,GPIO_AF5
#define SPI1_SCK_PB3_ PB3,GPIO_AF5
#define _SPI1_SCK_PA1_ 1
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1

#define SPI2_MISO_PB14_ PB14,GPIO_AF5
#define SPI2_MISO_PC2_ PC2,GPIO_AF5
#define SPI2_MISO_PD3_ PD3,GPIO_AF5
#define _SPI2_MISO_PB14_ 1
#define _SPI2_MISO_PC2_ 1
#define _SPI2_MISO_PD3_ 1

#define SPI2_MOSI_PB15_ PB15,GPIO_AF5
#define SPI2_MOSI_PC1_ PC1,GPIO_AF3
#define SPI2_MOSI_PC3_ PC3,GPIO_AF5
#define SPI2_MOSI_PD4_ PD4,GPIO_AF5
#define _SPI2_MOSI_PB15_ 1
#define _SPI2_MOSI_PC1_ 1
#define _SPI2_MOSI_PC3_ 1
#define _SPI2_MOSI_PD4_ 1

#define SPI2_NSS_PB12_ PB12,GPIO_AF5
#define SPI2_NSS_PB9_ PB9,GPIO_AF5
#define SPI2_NSS_PD0_ PD0,GPIO_AF5
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PB9_ 1
#define _SPI2_NSS_PD0_ 1

#define SPI2_SCK_PA9_ PA9,GPIO_AF5
#define SPI2_SCK_PB10_ PB10,GPIO_AF5
#define SPI2_SCK_PB13_ PB13,GPIO_AF5
#define SPI2_SCK_PD1_ PD1,GPIO_AF5
#define SPI2_SCK_PD3_ PD3,GPIO_AF3
#define _SPI2_SCK_PA9_ 1
#define _SPI2_SCK_PB10_ 1
#define _SPI2_SCK_PB13_ 1
#define _SPI2_SCK_PD1_ 1
#define _SPI2_SCK_PD3_ 1

#define SYS_JTCK-SWCLK_PA14_ PA14,GPIO_AF0
#define _SYS_JTCK-SWCLK_PA14_ 1

#define SYS_JTDI_PA15_ PA15,GPIO_AF0
#define _SYS_JTDI_PA15_ 1

#define SYS_JTDO-SWO_PB3_ PB3,GPIO_AF0
#define _SYS_JTDO-SWO_PB3_ 1

#define SYS_JTMS-SWDIO_PA13_ PA13,GPIO_AF0
#define _SYS_JTMS-SWDIO_PA13_ 1

#define SYS_JTRST_PB4_ PB4,GPIO_AF0
#define _SYS_JTRST_PB4_ 1

#define SYS_TRACECLK_PE2_ PE2,GPIO_AF0
#define _SYS_TRACECLK_PE2_ 1

